<template>
  <div class="home">
    <button v-if="!isMenu" class="btn-burger" @click="isMenu = !isMenu">
      Menu
    </button>
    <ul v-else class="menu-scroll-list">
      <li class="btn-burger-li" @click="isMenu = !isMenu">x</li>
      <li v-for="(item, i) in menuList" :key="i" @click="scrollTo(item)">
        {{ i + 1 }} {{ item }}
      </li>
    </ul>

    <h1 class="title">
      {{ book.title }}
    </h1>

    <h2 class="sub-title">
      {{ book.subTitle }}
    </h2>

    <template v-for="(elem, key) in book.chapters">
      <div v-if="elem.title" :key="key">
        <h2 :ref="elem.title" class="chapters-title">
          {{ elem.title }}
        </h2>

        <template v-for="(post, index) in elem.content">
          <p
            v-if="typeof post === 'string'"
            :key="index"
            style="white-space: pre-wrap; margin-top: 0"
            v-html="post"
          ></p>

          <template v-else>
            <div v-if="!post.img" :key="index" class="info">
              <table>
                <tr>
                  <td>Опис малюнка:</td>
                  <td>{{ post.pictureDescription }}</td>
                </tr>
                <tr>
                  <td>Герої:</td>
                  <td>{{ getListHeroes(post.heroes) }}</td>
                </tr>
                <tr>
                  <td>Опис фону:</td>
                  <td>{{ post.backgroundDescription }}</td>
                </tr>
              </table>
            </div>
            <img v-else :key="index" :src="post.img" :alt="post.alt" />
          </template>
        </template>
      </div>
    </template>
  </div>
</template>

<script>
/* eslint-disable */
export default {
  name: 'HomeView',

  data: () => ({
    isMenu: false,

    book: {
      title: 'ПРИГОДИ ПАВУЧКА І ЙОГО ДРУЗІВ',
      subTitle: '“Як добре, що є друзі!”',
      chapters: [
        {
          title: 'Подорож павучка',
          content: [
            `
    Пролетіло тепле літечко...
    Осінь заглянула холодними,  росяними ранками до лісу.
    Павучок, прокинувшись, відчув, що лапки замерзли й в гамачку вже не так комфортно, як влітку.
    Зажурився сердешний:
    -Зима невдовзі. Павутину снігом закидає, що робитиму?
    А Сорока - Скрекотуха почула, як сумує і рознесла по всьому лісу: “Зима наступає, Павук замерзає!”
    Почули це звірята і стали запрошувати Павучка до себе на зимівлю. Першою прибігла гарненька вивірка Рижулька.
    -Швиденько сідай на спинку і я віднесу тебе до свого дупла. У мене тобі буде тепленько.
    Павучок погодився і вже за хвилину був у дуплі. У білочки смачно пахло сушеними грибами.
    По куточках лежали зернята, жолуді. А посередині, згорнувшись в один великий клубок, спали білченята. Сонечко піднялося в небо і заглянуло в дупло. Білченята почали прокидатися, потягуватися і вовтузитися. Павучок зрозумів, що білченята ще підростуть і всім в дуплі буде затісно. Тому, чемно подякувавши білочці Рижульці, спустився на павутинці до низу.
            `,
            {
              img: null,
              alt: '',
              size: '248x315',
              pictureDescription: '',
              heroes: ['Павучок', 'Сорока', 'білочка Рижулька', 'Їжачок'],
              backgroundDescription: '',
            },
            `
    Тим часом пробігав Їжачок. Він побачивши Павучка, привітався й мовив:
    - Я чув від Скрекотухи, що ти замерзаєш? Прошу до моєї нірки. Запасів багато не маю, взимку сплю. Проте в мене тепло, вистелено кубло листям, травами.
    Будемо спати, а прийде весна - розбудить співом птахів.
    Павучку сподобалась гостинність Їжачка, і він погодився.
    Вночі Їжачок солодко сопів, пирхав, навіть посміхався.
    Певно, щось приємне снилося.
    Павучок дивився на товариша, але заснути не зміг. Запах полину наповнював нору. Павучок тихесенько, щоб не розбудити, виліз з нори. Поряд з норою він узрів старий пень. Побачивши шпарку в корі, він заглянув всередину. Там було тепло, сухо і тихо. Павучок подумав, що добре було б мати своє житло, і почав крутити кокон. За роботою пройшов день. Він був задоволений своїм новим житлом.
    Поклавши натруджені лапки, відразу заснув. У сні він бачив Білочку з її милими білченятами, Їжачка - добрячка і небайдужу Сороку - білобоку. Все - таки, як добре, що є друзі.
            `,
            {
              img: null,
              alt: '',
              size: '248x315',
              pictureDescription: '',
              heroes: [''],
              backgroundDescription: '',
            },
          ],
        },
        {
          title: 'Відлига',
          content: [
            `
    Пригріло тепле сонечко і розтопило лід в серденьку Зими.
    Вона посміхнулася, розтанув сніг, заблищали калюжі. Зелена травичка неначе ожила. Прокинувся в шпарці й Павучок.
    - Що, вже весна? Як швидко, - потягуючись, промовив він.
    - А я ще не всі сни додивився і не виспався, як слід. Але чому птахи не співають? Так тепло, вони мали вже повернутися з теплих країв...
    В роздумах Павучок виліз зі свого теплого кокона.
    - А на вулиці не так вже й тепло, - зауважив він.
    Неподалік побачив горобчика. Малий на радощах щось клював в травичці.
    - Привіт, сіренький! А що, вже весна прийшла?
    Горобець сполохано почав роззиратися навкруги.
    - Це я, Павучок біля пеньочка.
    - О, привіт! А я тебе відразу і не помітив. Ні, ще до весни далеко, грудень місяць. Просто, пригріло сонечко і почалась відлига. А ти чому прокинувся? Ховайся, ще будуть сніги. Грудень місяць це - перший місяць зими. Ще січень зі своїми морозами та лютий з заметілями й хуртовинами. А потім і весна прийде, якщо не забариться.
    Ховайся, бо ти зовсім роздягнений. У мене хоч пір'я, та гріє.
    - А я собі думаю - чому ти не купаєшся в калюжі. Ви  горобці перші відкриваєте сезон купання. Ще на Стрітення міряєте калюжі. Б-р-р. ..Струснувся Павучок і посунувся до своєї шпарини:
    - Дякую тобі друже, піду спати. Я ще не додивився серіал цікавого сну. Прийде весна -  зацвірінькай, будь ласка, щоб я не проспав її прихід.
            `,
            {
              img: null,
              alt: '',
              size: '248x315',
              pictureDescription: '',
              heroes: [''],
              backgroundDescription: '',
            },
          ],
        },
        {
          title: 'Повінь',
          content: [
            `
    Павучок, закутавшись у кокон, солодко заснув. Йому снилося щось дуже приємне і він час від часу посміхався. Додивляючись чергову серію своїх кольорових снів, Павучок відчув, що кокон його ніби плаває.
    -Невже повінь? Для весни ще зарано, - розмірковував він крізь сон.
    - Напевно, треба подивитися, що то за проблема.
    Він виглянув з кокона, а навколо мокро.
    -Добре, що кокон у мене водонепроникний, - подумав він.
    -Але звідки вода? Навіть за проливних дощів у мене не було так мокро.
    Виглянувши зі шпаринки, він побачив білочку Рижульку. Вона гірко плакала, а сльози горохом котилися прямо в шпаринку Павучка.
    - Рижулька, що сталося, чому так сльози проливаєш, повінь мені утворила?
    Білочка від несподіванки замовкла.
    - Отак краще, а то ти залила сльозами мою оселю.
    - Я не хотіла, - схлипуючи, відповіла білочка.
    - У мене пропало білченя, - знову, заходячись плачем, повідомила Рижулька.
    - Просила його - не відходь далеко, бо заблукаєш. Він у мене такий спритний: і грибочка першим знайде, і жолуді швидше всіх носив. Вже сутеніє, всі білченята в дуплі, а його нема. Він ще дуже маленький і небезпека чатує на нього на кожному кроці.
    Невтішна білочка зійшла з пеньочка і знову сльози покотилися з її оченят.
    - Не плач, зараз щось придумаємо. - заспокоював її Павучок.
            `,
            {
              img: null,
              alt: '',
              size: '248x315',
              pictureDescription: '',
              heroes: [''],
              backgroundDescription: '',
            },
            `
    - Але що ти можеш придумати?
    - Головне, не панікуй, - твердо відповів він.
    - Хто у нас в лісі все знає і чує?
    - Сорока ...- з надією відповіла білочка.- Але вона вже прилітала і запитувала чому я плачу.
    - І що порадила?
    - Нічого, знялася і полетіла, нічого не сказавши.
    - А тепер подумай, чому вона нічого не сказала?..От, правильно, тому, що у неї не було потрібної інформації. Вона в біді не залишить.
    - А ось подивися, вона летить, а поряд з гілки на гілку перелітає маленьке білченя. Біжи,  зустрічай! - з посмішкою мовив Павучок.
    Не встигла Рижулька повернутися, як Сорока з білченям були поряд.
    Малеча кинулася до матусі білочки з благальним, винуватим поглядом і  промовило:
    - Матусенько, вибач, будь ласка, я заснув...Бігаючи по лісу, я стомився. А в старому закинутому дуплі вітер настелив листя і я сів зовсім трішки відпочити й заснув.Там було м'яко і тепло. А потім мене розбудила пані Сорока. Опустивши очі, він притулився до білочки й важко зітхнув. Рижулька обняла своє дитинча, вона вже не плакала і зовсім не ображалася на маленького неслуха. Павучок посміхався. А Сорока - скрекотуха, перевівши подих, повідомила, не приховуючи свого задоволення:
    - Напевно, відкрию  ,,Пошукову агенцію''.
    Всі дружно засміялися. Білочка подякувала всім за підтримку.
    І, втішено, подумала вголос:
    - Як добре, що є друзі.
            `,
            {
              img: null,
              alt: '',
              size: '248x315',
              pictureDescription: '',
              heroes: [''],
              backgroundDescription: '',
            },
          ],
        },
        {
          title: 'Різдвяне диво',
          content: [
            `
    Павучок, не приховуючи свого задоволення, що історія з білченям закінчилась щасливо, попрощався з друзями:
    - До зустрічі! Хоч події дуже теплі, та щось я замерз. Піду до своєї шпаринки.
    Він ще довго не міг заснути, приємні відчуття переповнювали його серденько. Зігрівшись, таки задрімав. Сни закружляли картинками, розважаючи Павучка.
    Ось простора галявина, на ній посередині зелена красуня ялинка. Звірята прикрашають її лапасті віти. Знизу, на рівні росту їжачка, висіли яблучка. Трішки вище зайченя, піднявшись навшпиньки, вішало соковиту, помаранчеву морквинку. Ще вище - білченята чіпляли горішки. На самій верхівці Сорока підвішувала жолуді. Пташки прикрашали ялинку засушеними барвистими листочками, які під час вітру були схожі на живих метеликів. Ялинка оживала...
    Павучку смішно було бачити на ялинці моркву, яблука, горішки й жолуді. Але ж це не звичайна ялинка, а Різдвяна!
    Звірята готувалися до святкування, вчили колядки, вірші - віншування. Павучок посміхався уві сні, дивлячись на передсвяткову метушню і хвилювання. Сорока складала сценарій свята, адже вона була ведучою. А це - велика відповідальність. Білченята репетирували танець. Вони мило кружляли навколо святкової ялинки.
    Раптом...Між дерев з'явилася постать, від якої всі напружилися. Зайці нашорошили свої довгі вушка, а мама Білочка швидко метнулась до своїх дитинчат. З лісу вийшла руда Лисичка...

            `,
            {
              img: null,
              alt: '',
              size: '248x315',
              pictureDescription: '',
              heroes: [''],
              backgroundDescription: '',
            },
            `
    Вона чемно перепросила, що без запрошення:
    -Але я з подарунками для вашої Ялиночки.
    З - за спини вона з задоволенням підняла на лапці  паперових Янголят. Вони були дуууже красиві. Мережані спіднички від подиху вітру закружляли й здавалося, що вони ожили спустившись з небес.
    -Я почула, що готується свято для звірят. І попросила малят з художньої школи подарувати вашій ялиночці цих чудових Ангеликів.
    Звірята від несподіванки не могли поворухнутися. Вони зачаровано дивилися на це  дійство, не вірячи своїм очам. Та Сорока, швидко зорієнтувавшись, подякувала за чудовий подарунок. Вона запросила Лисичку на свято, попередивши, що за чемну поведінку всіх очікують подарунки.
    Павучок подумки був разом зі своїми друзями. Він знав, що напередодні Різдва трапляються ще й не такі дива...

            `,
            {
              img: null,
              alt: '',
              size: '248x315',
              pictureDescription: '',
              heroes: [''],
              backgroundDescription: '',
            },
          ],
        },
        {
          title: 'Перше різдво павучка',
          content: [
            `
    І от нарешті наступило Різдвяне свято! Звірята з нетерпінням очікували  черги свого виступу. На галявині було досить гамірно.
    Це й розбудило Бабака Тимка. Його нора була неподалік ялини.. Він, розплющивши спочатку одне око, потім друге, виглянув з нори. Перед ним сяяла від прикрас  Різдвяна ялинка. Останні приготування вказували на те, що свято от - от розпочнеться. Добре, що нора неподалік, міг би проспати Різдво!
    Він знайшов у своїй комірці найбільшого жолудя і виліз з нори.
    - Ой, ми так галасувати, що розбудили Бабака, - зауважила білочка Рижулька.
    -То добре, що розбудили, бо проспав би свято. Ось мої гостинці, - простягнув жолудь Бабак.
    - От всі й зібралися!- Почала свою промову Сорока - Білобока.
    - Ні, не всі.- швидко зауважила Рижулька. Немає нашого Павучка.
    Він завжди був з нами, коли траплялася якась біда. Хотілось, щоб і на свято він був разом з нами.
    Сорока на хвильку задумалась, а потім попросила звірят зачекати 5 хвилиночок. Вона миттю долетіла до пеньочка, де спав Павучок, і дзьобом постукала по корі біля шпаринки:
    - Павучок, вибач що турбую, але у тебе залишилася лише хвилинка, щоб зібратися до ялинки.Візьми з собою кокон, я понесу тебе на Свято. Звірята чекають.
            `,
            {
              img: null,
              alt: '',
              size: '248x315',
              pictureDescription: '',
              heroes: [''],
              backgroundDescription: '',
            },
            `
    Павучок ніби чекав, за хвилину був на пеньочку.
    - Дякую тобі, Сороко - Білобоко, я мало не проспав Різдво.
    Але Сорока нічого не відповідала.
    Вона, міцно стуливши дзьоб, летіла до ялинки. Побачивши Сороку з Павучком, всі дружно заплескали в долоні. Сорока повісила кокон на ялинку і  в знак подяки зробила реверанс.
    Павучок став схожим на ялинкову прикрасу. Він щиро подякував друзям за те, що не забули про нього. З ялинки йому добре було видно виступи звірят. Святкова програма та увага друзів поселили в його маленькому серденьку чарівний дух Різдва.
    Це було найкраще Різдво і перше, яке Павучок не проспав.
            `,
            {
              img: null,
              alt: '',
              size: '248x315',
              pictureDescription: '',
              heroes: [''],
              backgroundDescription: '',
            },
          ],
        },
        {
          title: 'Сон павучка',
          content: [
            `
    Закінчилося веселе Свято. Дух Різдва ще витав у повітрі. Звірята ділилися враженнями від виступів. А Павучок вже міцно спав, лише час від часу переглядав чергову серію сну:
    Як зайці дружно змінювали свої шубки, щоб бути непомітними на снігу. Та чорний носик видавав їх  присутність. Мама Зайчиха вчила, що треба завмерти на місці, коли помітили хижака, а носика прикрити лапкою.
    Одне Зайченятко🐰, забувши настанову Матусі пішло шукати під ялинкою🌲 морквину, яку отримало на Різдво. Воно спритно розгрібало лапками сніг і...Ура! Знайшло морквину.
    Сяючи від радості взяло в лапки та почало гризти. Яка смакота ця морква 🥕, думало воно. Раптом, піднявши очі, воно побачило перед собою Лисичку🦊. Вона хитро спостерігала за малечею.
            `,
            {
              img: null,
              alt: '',
              size: '248x315',
              pictureDescription: '',
              heroes: [''],
              backgroundDescription: '',
            },
            `
    Зайченя згадало Матусину пораду, закрило ніс двома лапками, а надгризена морквина впала на сніг. Лисичка посміхнувшись мовила:
    - Пізно згадав і помаранчева морквина тебе виказала.
    - Зайченя дуже злякалося і не зводило оченят з Лисички.
    - Будь ласка, може візьмете морквинку, вона дуже соковита.
    Правда, я її трішки надгриз.
    - Ні, моркву я в дитинстві переїла, хотіла вирости. А в результаті -  стала оранжева моя шубка. Але вона мені личить.
            `,
            {
              img: null,
              alt: '',
              size: '248x315',
              pictureDescription: '',
              heroes: [''],
              backgroundDescription: '',
            },
            `
    У Зайченяти від страху затремтів хвостик і Лисичка це помітила.
    - Та не колотися ти так, я напередодні Колобка з'їла, сам на носика сів. Тож не голодна. Але зайчатину дуже полюбляю...Бери свою морквину і біжи до Матусі. Наступного разу будь обачніший, тут ще й вовки водяться.
    Зайченя на радощах підбігло до Лисички й обняло її за шию.
    - Дякую Вам, пані Лисичко, що мене не з'їли.
    Лисичка зніяковіла і тихо промовила: - Ну, ну, ну це вже зайве. Я ж все - таки хижак. І подала зайчаті морквинку, яка все ще лежала на снігу:
    - На, біжи, ато Матуся хвилюватиметься.
            `,
            {
              img: null,
              alt: '',
              size: '248x315',
              pictureDescription: '',
              heroes: [''],
              backgroundDescription: '',
            },
          ],
        },
        {
          title: 'Знайомство з світлячком',
          content: [
            `
    Переглянувши чергову серію свого сну і намулявши боки, Павучок відкрив свої перші очі. Але, нічого не побачивши, відкрив другу пару очей. І знову темно, нічого не видно...
    -Напевно, мені потрібні окуляри👓, - подумав він у голос.- Такі, як у шановної пані Сороки. Коли вона на святі Різдва біля ялинки 🌲заглядала в сценарій, то одягала окуляри.
    Вони сиділи у неї на дзьобі й навіть їй пасували. Дзьоба у мене нема, та щось придумаю...
    Поряд хтось завовтузився... І враз в помешканні Павучка стало світло. Від несподіванки він замружив всі свої очі. Потім, потихеньку відкриваючи одне око, потім друге, побачив комаху з маленькою головою, великими очима і середньої довжини вусиками. Ті очі привітно дивилися на Павучка. А ніжне світло лилося з черевця комахи.
    Трохи оговтавшись, Павучок запитав:
    - Ти хто?
            `,
            {
              img: null,
              alt: '',
              size: '248x315',
              pictureDescription: '',
              heroes: [''],
              backgroundDescription: '',
            },
            `
    - Я - Світлячок. Моє помешкання корягою нижче. Почувши, як ти плануєш придбати собі окуляри, я вирішив посвітити тобі. Можливо окуляри й не знадобляться. По - перше, ще ніч, а по - друге, наші помешкання не мають вікон.
    І знову м'яке, жовте світло залило помешкання. Це схоже було на весняний промінець, який проник в шпаринку. Від цього світла Павучку стало тепло на душі.
    - То окуляри мені зовсім не потрібні, я тебе добре бачу. Ти випромінюєш жовте світло.
    - Авжеж, а мої родичі вміють випромінювати зелене, блакитне і червоне світло.- відповів Світлячок. - Це наша особливість -
    Здатність до біолюмінесценції.
    - Складне слово, але я його запам'ятаю.- мовив Павучок.- Я теж хочу навчитися так світити. Допоможеш мені?
    Але Світлячок вже зник, так тихо, як і з'явився. А Павучок ще лежав і думав, що коли прийде весна, обов'язково навчуся випромінювати світло...
            `,
            {
              img: null,
              alt: '',
              size: '248x315',
              pictureDescription: '',
              heroes: [''],
              backgroundDescription: '',
            },
          ],
        },
        {
          title: 'Стрітення',
          content: [
            `
    Павучок знову солодко заснув. У снах він мріяв, що буде світитися, як його новий сусід Світлячок. А від того мило посміхався. Одного разу в його шпарині знову засяяло світло. Павучок зрадів, що Світлячок почав приходити до нього в сни.
    - Доброго дня, сусіде! - Покликав його Світлячок.
    - Доброго...- не відкриваючи очей, сонно пробурмотів Павучок.
    - Прокидайся! Сьогодні Стрітення. Зима зустрічається з Весною.
    Павучок підскочивши сів у своєму коконі та радісно запитав:
    - Що, весна прийшла?
    - Ну, не зовсім. Просто вони сьогодні зустрічаються.
    - А потім ще будуть зустрічатись і млинці їсти. А сьогодні горобець має купатися в калюжі, або напитися з неї. Народні прикмети: "Якщо горобці на Стрітення купаються в калюжі, то морозу дожидай і холоднечі". "Якщо на Стрітення горобець з калюжі напився – весна наближається."
    Якщо вигляне сонечко, то зима невдовзі піде. А якщо хмари затягнуть небо, то ще будуть морози й заметілі.То як, виліземо на пеньок подивимось, яка буде весна?
            `,
            {
              img: null,
              alt: '',
              size: '248x315',
              pictureDescription: '',
              heroes: [''],
              backgroundDescription: '',
            },
            `
    - Добре, — погодився Павучок.
    -Але я зі своїм коконом, щоб не змерзнути.
    Вони вилізли на пень і стали роззиратися навколо.
    - Он поглянь, калюжа є, а горобця не бачу, — заклопотано мовив Світлячок.
    - Він сидить зверху на гілляці. У мене декілька пар очей, то я все бачу.- відповів Павучок.
    - І правда, — піднявши голову, Світлячок побачив горобця.
    Горобець підлетів до калюжі та почав пити холодну воду.
    Поволі з — за ялинки викотилося сонце. Воно промінням торкнулося наших маленьких друзів і залило світлом пеньок, на якому вони сиділи. Павучок від задоволення примружив очі...
    В ту ж мить Горобець підлетів до них і хотів клюнути Світлячка...
    Павук, вискочивши із кокона, перегородив йому дорогу.
    -Не смій, це — мій друг!
            `,
            {
              img: null,
              alt: '',
              size: '248x315',
              pictureDescription: '',
              heroes: [''],
              backgroundDescription: '',
            },
            `
    - А, це ти Павучок? Привіт! Чому так рано виліз, весна ще не прийшла. Я обіцяв розбудити тебе і дотримаю слова.
    - Ми з моїм товаришем і сусідом Світлячком хотіли подивитися, як ти купаєшся.
    - Обов'язково скупаюсь, але не сьогодні. Запевняю, весна прийде вчасно. Ще розбудимо бабака Тимка, він має підтвердити мої прогнози.
    - А коли будитимете? Ми теж хочемо подивитися на це дійство.
    - Спитаю у Сороки, вона все знає. Потім прилечу за вами.
    А Світлячок їх вже не слухав.Він від радості сяяв, як сонечко, але при денному світлі цього ніхто не бачив. Йому було дуже приємно, що Павучок назвав його другом і заступився, коли Горобець хотів його з'їсти.
    "Як добре, що є друзі, "- подумав Світлячок. І його маленьке серденько наповнилося теплом та вдячністю.
            `,
            {
              img: null,
              alt: '',
              size: '248x315',
              pictureDescription: '',
              heroes: [''],
              backgroundDescription: '',
            },
          ],
        },
        {
          title: 'Прогнози Тимка',
          content: [
            `
    Горобець підлетів до ялини на галявині, де проходили всі свята і події лісових мешканців. Сорока -  скрекотуха щось розказувала Білочці. Горобець перепрошуючи звернувся до Сороки:
    - Пані Сороко, чи скоро будитимемо бабака Тимка?
    - Так, як раз плануємо сьогодні й будити. Білочка збере всіх звірів, а тобі доручимо птахів сповістити.
    - Мене просили Павучок зі Світлячком, щоб приніс їх до ялини.
    - От і добре, донесеш сам?
    - Так, зрадів Горобчик, але спочатку я покличу птахів.
    Випурхнувши він зник в гущавині лісу.
    А тим часом звірі почали збиратися біля ялини. Вони несли смаколики для Тимка. Хто солодкий корінець, мох. Білочка - засушені квіти конюшини, а зайченя принесло морквину. Бабак всю зиму проспав. То дуже зголоднів. Прокидався лише на Різдво, коли звірі своїм галасом розбудили його. Та за це він був вдячний їм. Він завжди мріяв побачити, як звірята зустрічають Різдво. А нині всі сподівалися на гарний прогноз від Тимка. Дуже хотілося приходу весни.
            `,
            {
              img: null,
              alt: '',
              size: '248x315',
              pictureDescription: '',
              heroes: [''],
              backgroundDescription: '',
            },
            `
    І от нарешті всі зібралися! Горобець, посадивши в кокон Павучка і Світлячка, приніс їх і повісив на ялину. Звідти вони бачили все, як на долоні. Світлячок признався, що ніколи не літав в гамачку, то трохи перенервувався.
    - Не бійся, друже, я поряд і літаю не вперше. Правда у Сороки турбулентність менша і швидкість польоту більша. Та головне, що ми на місці.
    - Павучок, а ти домовився, щоб нас назад віднесли, - запитав Світлячок?
    - Ні, Горобець відразу полетів займати місце у перших рядах нори бабака Тимка.
    - І, як ми дістанемось додому, чи будемо Весну зустрічати на ялинці?
    - Та не нервуйся ти так! Все буде добре! Зараз, головне не пропустити Тимкове пробудження.
    Сорока підійшла до нори й заскрекотала... Тихо...Тоді підійшла ближче білочка Рижулька і голосно гукнула: Тимчику, прокидайся! На тебе чекають смаколики! З нори почулося вовтузіння і виглянула сонна мордочка Тимка. Примружені очі ледве дивилися на світло. Круглі, як щоки м'ячики трохи обвисли та й живіт десь дівся... Але, побачивши морквину в простягнутих лапках зайченяти очі округлилися і слинка підкотила до рота. Він вже збирався взяти морквину, та спритна Сорока - білобока підскочила і привітавшись спитала: Як спалося Тимчику? І, що цього року напророкуєш нам?
            `,
            {
              img: null,
              alt: '',
              size: '248x315',
              pictureDescription: '',
              heroes: [''],
              backgroundDescription: '',
            },
            `
    Тимко випрямив спину і так, як день був сонячний він побачив свою тінь. Зібравши гостинці та чемно подякувавши він знову поліз до нори. Сорока звернулась до лісових мешканців і попросила запастись терпінням. Тому, що Тимко пішов ще спати, тому буде декілька морозних тижнів. Звірі почали розходитись. Світлячок так рознервувався, що їх забудуть, що почав світитися, потім погас, знову світився...Сорока звернула увагу, що на ялинці засвітився вогник, як на Різдво. Спитавши Горобця:
    - Ти нікого не забув?
    - Добре, я сама їх віднесу. Де мешкають, я знаю. Горобець подякувавши полетів. А наші друзі на великій швидкості з низькою турбулентністю прибули до свого пеньочка. Світлячок дуже дякував пані Сороці за м'яку посадку. Він дуже хвилювався за свого ліхтарика, щоб не розбити.
            `,
            {
              img: null,
              alt: '',
              size: '248x315',
              pictureDescription: '',
              heroes: [''],
              backgroundDescription: '',
            },
          ],
        },
        {
          title: 'Несподіваний гість',
          content: [
            `
    Павучок, налітавшись, відразу заснув. А Світлячок довго не міг заснути. Враження переповнювали його маленьке серденько. Тим часом у лісі вечоріло...Сонце покотилося за обрій. Стомившись від насиченого подіями дня, воно вкладалося спатки.
    - Гарний день, — подумав Світлячок, — напевно, вилізу зі шпаринки подихаю свіжим повітрям.
    Поглянувши на небо, він затамував подих. Зірки вкрили небесний простір і час від часу ніби підморгували Світлячку своїм миготливим сяйвом.
    -Як гарно, тихо...Вітерець теж, напевне, заснув,- подумав він.
    Та раптом неподалік тишу розрізав пронизливий крик:
    "Пугу — пугу". Світлячок мало не впав на землю. З переляку він почав світитися. Десь зовсім близько, щось зашкряботіло. Світлячок сховався у свою шпарину і боявся поворухнутися. Яскраве світло заливало його кімнату. Він спробував заплющити очі, але шкряботіння було зовсім поряд... А над головою знову пролунало  "Пугу — пугу". Світлячок кинувся до шпарини Павучка. Сердечко мало не вилітало з грудей.
            `,
            {
              img: null,
              alt: '',
              size: '248x315',
              pictureDescription: '',
              heroes: [''],
              backgroundDescription: '',
            },
            `
    - Павучок, Павучок! - почав будити товариша Світлячок. - там щось відбувається.
    - Де ? - сонно запитав Павучок.
    - Там! - піднявши до верху очі, ледве промовив Світлячок.
    Зверху знову почулося: ,,Пугу — пугу''.
    - А-а-а.. То Сич вийшов на полювання, — мовив Павучок.
    - І на кого він полює? - Не міг заспокоїтися Світлячок.
    - На мишей, може зайчат вполювати, якщо ті необачно відійдуть від матусі.
    - Ого, а я чув, як щось шкряботіло під пеньком.
    - То мишка. Вона, певно, встигла сховатися. А Сич буде сидіти на пеньку і виглядати здобич.
    Головне — не вилазь на пеньок, бо не помітить і затопче.
    - А я думав, що вночі всі сплять, вже трохи заспокоївшись, мовив
    Світлячок.
            `,
            {
              img: null,
              alt: '',
              size: '248x315',
              pictureDescription: '',
              heroes: [''],
              backgroundDescription: '',
            },
            `
    - Та ні...Сови, тільки починає сутеніти, вилітають на полювання. У них дуже добрий зір, але в повній темноті вони теж погано бачать. Проте слух у них відмінний. Як тільки миша пискне, або трохи поворухнеться, сова відразу на неї кидається. А ще має таку шию, що повертає голову на 270⁰, уявляєш?
    - А Світлячків вони їдять? - допитувалася стурбована комаха.
    - Ні, ти — мала для нього пожива.А сови дуже прожерливі, вони можуть з'їсти до 10 мишей за один раз.
    - Ого! -Округливши очі, які вже не заснуть до ранку, дивувався Світлячок.- А звідки ти все знаєш?
    - А мені сам Пугач одного разу розповідав. Що його занесено в Червону книгу і його охороняє закон!
    - А хто такий той Закон?
    - Та я й сам не знаю, але людина не має права вбивати Пугачів тому, що їх залишилося мало. А ще хизувався, що в нього є родич далекий — євразійський пугач, який має вагу понад 4.5 кілограми, а зростом 75 см.
    Розмах крил до двох метрів, уявляєш?
    - Ого! - Знову дивувався Світлячок.
    - Так, якщо Пугачі не їдять Світлячків, то я піду до себе в кімнату. Попрощавшись, він поліз у свою шпарину.
            `,
            {
              img: null,
              alt: '',
              size: '248x315',
              pictureDescription: '',
              heroes: [''],
              backgroundDescription: '',
            },
          ],
        },
        {
          title: 'На гостину',
          content: [
            `
    Сонце відкрило оченята і почало будити мешканців лісу. Під пеньком  прокинулась Мишка. Вона почала господарювати у своїй нірці, шурхотом розбудивши Світлячка. Він виглянув зі шпаринки,  чемно привітався:
    - Доброго ранку, пані Мишко! Як почуваєтеся? Сьогодні вночі Пугач прилітав на наш пеньок.
    - Доброго раночку, - піднявши очі, мовила Мишка.  Він часто прилітає сюди, хижий птах.Та мене йому не впіймати. Я завбачливо зробила потайні ходи, які ведуть до пеньочка. А ви, пане Світлячок, мій сусід? Вчора бачила, що м'яке світло лилося зі шпаринки.
    - Так, я вчора був дуже наляканий, а тому піднявся до Павучка.
    - Він прокинувся? Павучки, зазвичай, сплять взимку у своїх коконах.
    -  Прокинувся, - винувато опустивши голову, мовив Світлячок. Я його розбудив...Сьогодні нехай відпочиває.
            `,
            {
              img: null,
              alt: '',
              size: '248x315',
              pictureDescription: '',
              heroes: [''],
              backgroundDescription: '',
            },
            `
    - Пане Світлячок, - шанобливо звернулась Мишка.
    - Можу я вас попросити пройтись зі мною по норах і посвітити мені?
    - Звичайно, - погодився Світлячок.
    - Тоді вирушаємо? - запитала Мишка.
    -Так, згода.- і Світлячок поспішив за мишкою.
    Зайшовши в комірку Мишки він відчув запах прілого листу, сирої землі, яке поєдналось з ароматом трав. Світлячок включив свою систему біолюмінесценції й м'яке світло залило помешкання Мишки.
    Дбайлива ґаздинька, подумав Світлячок. По куточках в неї лежали великі жолуді, дрібні зернята, якісь засушені гриби, овочі. Далі починалися нескінченні лабіринти ходів. Ідучи  Мишка розповідала, що багато праці вклала, щоб побудувати таку захисну систему переходів. Зате, Сичу її тепер не дістати.
    А ще розповідала, що раніше жила біля помешкання людини.
            `,
            {
              img: null,
              alt: '',
              size: '248x315',
              pictureDescription: '',
              heroes: [''],
              backgroundDescription: '',
            },
            `
    Там їжі було вдосталь, та господарі взяли собі маленьке кошеня:
    - Спочатку воно гралося зі мною, склалися навіть дружні відносини. Та коли у мене з'явилися маленькі мишенята, Кошеня повелося, як хижак і напало на моїх дитинчат.
    Тоді я зрозуміла, що коти нам не друзі й перебралася жити до лісу.
    - Гарно у Вас, пані Мишко, просторо.
    Повернувши вправо Мишка зупинилася. Серед невеличкої нірки, у дбайливо вистеленому кубельці спали малесенькі рожеві мишенята. Вони були зовсім голі, а тому скидалися своїм видом на хробачків.
    - Це ваші? - запитав Світлячок.
    - Тсс... Приклавши пальчик до рота, тихесенько мовила Мишка.
    - Правда красені? - милуючись дітлахами вона посміхалася.
    - Так, - відповів Світлячок.
    І подумав, що для кожної матусі її дітки найкращі, навіть голенькі й зморщені, як ці манюні сліпі мишенята.

            `,
            {
              img: null,
              alt: '',
              size: '248x315',
              pictureDescription: '',
              heroes: [''],
              backgroundDescription: '',
            },
            `
    - Дякую Вам, милий Світлячку, за ваше світло, я побачила, які вони в мене гарненькі, всі семеро мишенят.
    -Повертаймо до виходу, я пригощу вас смакотою зі своєї комірки, - мовила вона.
    - Дякую Вам, мила господинько, але по дорозі мені стрілися перепрілі рештки рослини, яку я полюбляю. То з вашого дозволу я посмакую ними.
    Взагалі, то я хижак... М'ясоїдний жук. Полюю на інших комах, на гусениць метеликів - совок, молюсків, багатоніжок, дощових черв’яків. Та інколи харчуюся нектаром і пилком квітів, а також напівзогнилими рослинами.
    Мишка здивовано дивилась на Світлячка. Напевно в комах і тварин різні смаки та уподобання в їжі.
    Світлячок подякувавши за гостину запитав, чи зможе він час від часу, коли зголодніє, приходити підкріпитися цією смакотою.
    - А я вам світитиму, коли у вас виникне у цьому потреба.
    Мишка була щаслива, що у неї, хоч щось знайшлось на гостину для жука - хижака, який дарує світло.
            `,
            {
              img: null,
              alt: '',
              size: '248x315',
              pictureDescription: '',
              heroes: [''],
              backgroundDescription: '',
            },
          ],
        },
        {
          title: 'Лось',
          content: [
            `
    Наступного дня вранці Мишка підмітала біля входу у свою нірку. Та раптом на неї полетіли грудки землі. Мишка ледве встигла заскочити в нірку.
    Потім потихеньку підійшла до напівзасипаного входу подивитися звідкіля прилетіло це лихо... Недалеко від пенька Лось, розгрібаючи землю під снігом, шукав мох. Він з апетитом з'їдав м'які кущики. І ось, коли знову хотів розгрібати сніг, який випав напередодні вночі, почув відчайдушний писк...Оглянувшись, він побачив біля пеньочка мишку.
    - Що сталося, чому такий переполох? - запитав Лось.
    - Ви, шановний, мало не засипали  вхід в мою нірку, а кору під якою живуть мої сусіди, припорошили землею. А вони маленькі, це може їм зашкодити. Ви не могли б повернутися в інший бік.
    - Перепрошую, мила Мишко, я не хотів накоїти вам лиха. Одну хвилину...
    Він підійшов до пеньочка і дмухнув щосили. Мишка миттєво опинилась в нірці на кучі жолудів.
    - Пане Лось, будь ласка, не треба дути.
    - Я лише хотів виправити скоєне.
    Від грудки землі, а потім сильного пориву вітру прокинулися одразу Павучок зі Світлячком. Світлячок миттєво прибіг в шпаринку до Павучка.
    - Друже, ти чув? Це, напевно, землетрус, а потім цей теплий вітер...То може це весна настала...
    - Я не перший рік весну зустрічаю, вона приходить тихо, хоча з теплим повітрям. Затихло... Піду погляну, що там сталось.
    - І я з тобою, друже,- заспішив Світлячок.
    Вони виглянули з - за кори й заклякли від страху...На них дивилися два величезні ока...
    Мишка, оговтавшись, пояснила, що сталося. Лось дихав і теплий  подих окутав друзів. Вони прийшли до тями та привітались:
    - Доброго дня, дядечку Лось! Раді бачити Вас біля нашого пенька.- Почав Павучок.
    - Ддууже раді, - мало не заїкаючись, промовив Світлячок.
    - Шановні, я щиро каюсь, що нагнав страху і розбудив вас. Взимку, - продовжував він, - коли дерева скинули свій лист, я харчуюся мохами. І розгрібаю їх під снігом.
    А на день мені потрібно до 15 кілограмів їжі.
    Світлячок, звернувшись до Павучка, запитав:
    - 15 кілограмів, це скільки?
            `,
            {
              img: null,
              alt: '',
              size: '248x315',
              pictureDescription: '',
              heroes: [''],
              backgroundDescription: '',
            },
            `
    - Не знаю, але дуже багато, - відповів йому Павучок.
    - А що ви взагалі їсте крім моху, пане Лось? - Поцікавився
    Світлячок.
    - Влітку у мене багатий раціон: трави, чагарники, мох, лишайники, гриби.Та найбільше ласую соковитим листом горобини й травою молодої осоки.
    - Так, ваші розміри вражають, -  мовив Павучок, - то і їжі треба багато.
    - Моя вага досягає 700 кг влітку, —продовжував Лось. - Я не хижак, з'їдаю багато рослинної їжі.
    Світлячок полегшено зітхнув: "Це заспокоює..."
    —Добре, що ви такий великий! Ходите, де хочете, все бачите.
    - Якщо є бажання, можу вас покатати, зробити екскурсію по лісу. А потім привезу до пеньочка, - мовив Лось.
    Друзі перезирнулись. Їм обом хотілося нових позитивних вражень. Але зупиняв страх загубитися по дорозі і вони поцікавилися на якій швидкості буде проходити екскурсія.
    Лось зрозумів і запевнив, що за їх безпеку він відповідає.
    - Щиро вдячна вам, шановний Лось, але відразу мушу відмовитись! - повідомила Мишка.
    –Я б з задоволенням, та своїх крихіток, маленьких мишеняток, не можу залишити самих в нірці.
    - А ми згодні, -  повідомив Світлячок.
    - І будемо дуже вдячні - чемно додав Павучок.
            `,
            {
              img: null,
              alt: '',
              size: '248x315',
              pictureDescription: '',
              heroes: [''],
              backgroundDescription: '',
            },
          ],
        },
        {
          title: 'Екскурсія по лісу',
          content: [
            `
    - А як я вилізу, ви такий великий, — запанікував Світлячок.
    - Не хвилюйся, я підійду до пенька, схилю голову, а ви підніметесь і всядетесь між ріг.
    Там добре буде видно і тепло.
    Павучок зі Світлячком швидко долали шлях, а Лось посміхався.
    Своїми лапками друзі лоскотали йому ніздрі й він боявся чхнути.
    Ось і повсідалися на лобі тримаючись за шерсть.
    - Ну що, шановні, вирушаємо?
    - Так! - відповіли вони разом.
    Лось з гордо піднятою головою поніс друзів на зустріч пригодам.
    По дорозі на снігу вони бачили безліч слідів. Пташині великі й маленькі, були схожі на ялиночки.
    - Ось погляньте, це зайчик стрибав, повідомив Павучок. А трохи далі сніг був переритий і змішаний з землею. На снігу виднілись сліди ратичок.
    - А це що таке? - запитав Світлячок.
    - Це дикі кабани шукали собі поживу, жолуді або солодкі корінці.- відповів Лось.
    Він розповідав, як виглядають сліди білочок, лисички.
    - А ведмежі сліди бачили? - поцікавився Світлячок.
    - Так, бачив, але ведмеді взимку, переважно, сплять. Якщо зима дуже тепла, то вони прокидаються і дуже тим незадоволені.
    Вони проходили між ялинами припорошеними сніжком.
    - Яка краса! - не стримував емоції Світлячок.
    - А то що таке? - показуючи на дивну споруду запитав Павучок.
    - То гостинці від людини, задоволено мовив Лось. Поклали нам свіженького сіна. Якщо ви не проти, то я трішки підкріплюсь.
    - Ні, не проти! - Одноголосно погодились друзі.
    Лось жував сухе різнотрав'я, яке пахло літом і теплом. Від задоволення він примружував очі.
    - Хороша все — таки ця людина, піклується про тварин, — мовив Світлячок.
    - Так, якби вони ще влітку не обривали мені павутину, були б взагалі ідеальні.
    - Може вони ненароком, або ти плетеш павутину там, де вони ходять? - припустив Світлячок.
    Тим часом Лось пообідавши запропонував піти до річки, там теж дуже красивий краєвид.
    В долині, обабіч річки лежав сніг. Вода мерехтіла на сонечку перекочуючись хвильками з камінчика на камінчик.
    - А тепер друзі міцно тримайтеся, — попросив Лось — я потихеньку нахилю голову і нап'юся водички.
    Може ви бажаєте?
    Ні! - Дружно відповіли друзі.
    Лось обережно нахилив голову і жадібно пив чисту водицю. Сонячні зайчики, що весело танцювали на хвильках заглядали в очі та кумедно посміхалися.
    - То хто такі? - запитав Світлячок.
    - То сонячні промінці — пустуни. Вони ніколи не сумують і завжди підіймають настрій. Мені влітку вони люб'язно просушують павутину. - відповів Павучок.
    Тим часом Лось почав підіймати голову.
    - Тримаєтесь? - запитав він.
    Так! - дружно відповіли друзі.
    - А зараз я відвезу вас до пеньочка. Взимку сонечко рано вкладається спати, то до заходу маємо встигнути.
    - Дякую Вам, дядечку Лось, що показали нам цю красу, — промовив Світлячок. Він набравшись вражень почав світитися.
    Лось помітивши посміхнувся:
    - То ми нині маємо власний прожектор і темнота нам не загрожує — мовив він.
    - Коли друзі поряд, нам нічого не страшно — гордо мовив Павучок.
            `,
            {
              img: null,
              alt: '',
              size: '248x315',
              pictureDescription: '',
              heroes: [''],
              backgroundDescription: '',
            },
          ],
        },
        {
          title: 'Весна прийшла',
          content: [
            `
    - Весна прийшла! Прокидайтеся, весна прийшла!
    Горобець підлетів до пенька і радісно зацвірінчав.
    Першим виліз Павучок:
    - Дякую тобі, друже! Дотримався свого слова, не забув розбудити.
    Сонечко гарно гріє, хоча ще подекуди під ялинами лежить сніг.
    - Та ти поглянь! На галявині підняли свої голівки проліски, — радісно цвірінчав горобчик.
    - Де Весна, чому я її не бачу? - протираючи сонні оченята, мовив Світлячок.
    - Її не видно, але, де вона ступає — розквітають квіти. Це пора року... Вона — в щебеті пташок, у цвітінні рясту, у веселих сережках красуні берізки.
    Світлячок крутив головою, роззирався навсібіч і повторював:
    - Ніде її не бачу.
    Горобець здивовано подивився на Світлячка і запитав: - То це твоя перша весна?
    - Так! - відповів Павучок.- А тому йому все цікаво. Він ще маленький і року не має.
    - Я вже великий! - заперечив Світлячок.- Мені скоро буде рік!
    - О, то в тебе скоро день народження? А коли, пам'ятаєш? - Запитав Горобчик.
    - Так, спочатку я народився у яйці. Потім з яйця вилупився личинкою, з личинки став лялечкою. У стадії лялечки я перебував 2,5 тижні. А весною виповзу з — під кори назовні дорослим жуком.
    - То, коли буде твій день народження? - все не міг зрозуміти Горобець.
    - Весною. Як вона прийде, відразу буде день народження. Я шукав її поглядом, але не бачив...
    Горобець, звернувшись до Павучка, запитав:
    - Що будемо робити? Він не розуміє, що весна — це пора року. Не лишати ж Світлячка Дня народження. Так він все життя чекатиме на весну.
    Павучок, подумавши, звернувся до Світлячка:
    - Розумієш, друже, поки ми спали, приходила Весна. Подивись, он на галявині вона лишила для тебе проліски.
    - То для мене? Всі ті красиві квіти для мене!? Дякую тобі, Весно!
    Друзі, то у мене сьогодні День народження!
    - Виходить, що так, — задумавшись, відповів Горобець, — але я не маю для тебе подарунка.
    - І я, — додав Павучок.
    - Найкращий подарунок — те, що ви зі мною в цей чудовий день! Дякую вам, друзі!
    На радощах він випромінював світло і був схожий на сонячний промінчик.
            `,
            {
              img: null,
              alt: '',
              size: '248x315',
              pictureDescription: '',
              heroes: [''],
              backgroundDescription: '',
            },
          ],
        },
        {
          title: 'День народження Світлячка',
          content: [
            `
    - Зачекайте, — попросив Світлячок, — буде не зручно перед сусідкою Мишкою і її мишенятами. Я хочу їх також запросити. Мишенята вже підросли за цей час, доки ми спали.
    - Ще, не забудь попросити Горобчика, щоб покликав пана Лося. Він дуже товариський і гарний екскурсовод. Гадаю, йому теж приємно буде! - Додав Павучок.
    - Дякую тобі, друже, що нагадав. Я заклопотаний і мало не забув...- з вдячністю мовив Світлячок.
    - А чим ти заклопотаний? - запитав Горобчик.
    - Мені потрібно привести до ладу свій костюм, адже я тільки-но прокинувся, а Іменинник має виглядати святково. До речі, як вважаєте, що більше пасуватиме до мого костюма, краватка чи метелик?
    - Думаю, метелик. Буде по весняному святково! - порекомендував Горобець і полетів шукати Лося.
    - Дякую, за пораду, друзі, зустрічаємось через годину на пеньку. - мовив Світлячок.
    А потім спустився до нірки Мишки й чемно покликав:
    - Пані Мишко, вийдіть на хвилинку, будь ласка. З нагоди мого повноліття, на пеньочку буде невеличке свято. Мені було б дуже приємно бачити Вас на ньому з вашими дітлахами через годину. Вони, напевно, вже підросли?
    - Так, відкрили оченята і покрилися шерстю. Вони такі гарненькі! Дякуємо вам, милий Світлячку, за запрошення, обов'язково будемо.
    Світлячок піднявся в шпаринку, щоб привести себе до ладу.
    За годину біля пенька зібралися: Лось, Горобець, Павучок, Мишка зі своїми чарівними мишенятами.
    Мама Мишка одягла блакитні метелики в білу горошинку чотирьом хлопчикам, а трьом дівчаткам пов'язала рожеві бантики в білий горошок на хвостики. Чорні, як намистини, оченята і рожеві носики чекали, поки на пеньочку з'явиться іменинник. Вони були дуже милі. Мишка перерахувала, наче всі...
    І ...Ось зворушлива мить! Світлячок вийшов на авансцену. Крила його фраку були начищені до блиску.
    Під сорочку на шию він пов'язав червону хусточку, що додало його образу солідності та чарівності. Він вирішив, що метелик, то дитяче.
    Всі дружно зааплодували. Потім Мишка почала диригувати й друзі хором заспівали:
    - З днем народження тебе!
      З днем народження тебе!
      З днем народження,
      милий Світлячку!❤️💐🌿!
    З днем народження тебе!
    Присутні дружно заплескали в долоні, а Іменинник поважно розкланявся на всі боки в знак подяки. Потім Лось покатав всіх по лісу. Мишенята були в захваті! Потім вони танцювали для іменинника на пеньочку. Для них це було найперше свято. Горобець вицвірінькував весняне соло, викликавши бурхливі аплодисменти. А Павучок, взувши свої черевички, підбиті металевими пластинами,
    танцював чечітку...Він відбивав ритм всіма вісьмома своїми ніжками. Ніхто ніколи не бачив, як гарно він танцює. Всі присутні милувалися виступом Павучка.
    - Дякую, друже. Ти — талант! - похвалив його Світлячок.
    - Це з дитинства лишились, матуся хотіла, що був хореографом.
    - А це хто такий? - запитав Іменинник.
    - Це той, хто гарно рухається під музику і навчає інших.
    - То, може тобі відкрити школу танців, я б з задоволенням навчався!
    - І я, і я! - запищали мишенята та застрибали так, що бантики почали спадати з хвостиків.
    - Добре, я подумаю, — відповів Павучок.
    Напроти пеньочка почувся лемент. Двоє мишенят вчепилися в проліска і намагалися його зірвати.
    - Облиште, не треба цього робити! - гукнув Світлячок.
    -Ті квіти мені подарувала Весна.
    І загадково посміхнувся.
    - Ми хотіли подарувати Вам пролісок, — винувато пропищали мишенята.
    А Лось додав, що проліски занесені в Червону книгу і зривати їх не можна. Мама Мишка, подякувавши за запрошення і чудове свято, зібрала мишенят та повела до нірки. Сутеніло, настав час вечірньої казочки. Гості почали розходитись по домівках. Світлячок дякував гостям і дарував світло свого серденька.
    " Як добре, що є друзі.."- думав він.
            `,
            {
              img: null,
              alt: '',
              size: '248x315',
              pictureDescription: '',
              heroes: [''],
              backgroundDescription: '',
            },
          ],
        },
        {
          title: 'Лісова студія хореографії',
          content: [
            `
    Наступного дня сонечко лагідно будило мешканців лісу. Промені проникали у всі шпаринки, даруючи весняне тепло. Мишенята не могли всидіти на місці й попросились погратися на сонечку біля нірки. Матуся нагадала, що мають бути обачними та далеко не відходити.
    Малеча закивала головами й галасливо вискочила на сонечко.
    Від веселого писку мишенят прокинулися одразу всі сусіди.
    Світлячок, згадуючи виступи та привітання у свій день народження, посміхався.
    - Павучок — талант, як славно він танцював! Хочу теж навчитися, сьогодні домовлюсь.
    Павучок лежав і розмірковував:
    - Може і справді відкрити школу танців?..Вчора було так багато охочих.
    - Привіт, Павучок! Ти вже прокинувся? Це я, Світлячок.
    - Так, друже ! Заходь, — мовив Павучок.
    - Я прийшов записуватися у школу танців, ти вже придумав назву?
    - Думаю, що це буде:
    ,,Лісова хореографічна студія''.
    - А репетиції де проходитимуть,
    на пеньочку? Для всіх охочий, чи буде відбір? - Світлячок сипав запитаннями. Павучок, подумавши, відповів:
    - Напевно, що всі, хто бажає навчатися зможуть відвідувати студію. Якщо збереться до 10 - ти охочих, то буде чудово!
    - Я допоможу тобі повісити оголошення, а Горобця попросимо сповістити лісових мешканців, згода? - запропонував Світлячок.
    - Дякую, друже, це буде дуже люб'язно з твого боку. А пані Мишку попрошу написати оголошення.
    - Я уявляю, як зрадіють мишенята, вони ще вчора стрибали від радості, — додав Світлячок.
    А мишенята згадували, як вчора було весело і поглядали на пеньочок. Побачивши Світлячка, притихли:
    - Ну, що, малеча, будемо вчитися танцювати? Кличте свою матусю!
    Мишенята запищали від радості.
    Мишка схвильовано вискочила з нірки:
    - Любі, що сталося?
    - Ми будемо танцювати, матусю, щойно повідомив пан Світлячок!
    - Так, а що скаже наш хореограф Павучок? - запитала вона.
    Тим часом Павучок піднявся на пеньок:
    - Скажу, що відкривається "Лісова судія хореографії'' і попрошу Вас, пані Мишко, написати оголошення, будьте люб'язні.
    - Я з великим задоволенням! - посміхаючись, відповіла Мишка.
    Тим часом Горобчик сповістив все лісове населення. Ця подія наробила чимало галасу, всі сподівалися навчитися красиво рухатися під музику. Збір призначено наступного дня біля пеньочка об 11 годині.
    Але вже о десятій годині почали збиратися охочі потрапити в студію танцю. Першими прийшли мишенята. Вони з нетерпінням поглядали на пеньок. Далі Білка з білченятами. Тітонька Сорока, прийшовши, стала у виворітну п'яту позицію. Мишенята намагалися повторити, а від того попадали. Трохи далі Зайчиха з зайченятами, а насамкінець прискакала зелена Жабка. Біля пенька не було вільного місця.
    Світлячок, одягнувши чешки, виліз зі своєї шпарини й завмер.
    - Павучок! - покликав він, — поглянь!
    Павучок в танцювальних черевичках піднявся на пеньок... Його здивовані очі стали ще більшими.
    Але в душі було дуже приємно, що стільки мешканців лісу мріють красиво танцювати.
    А на довершення всього з'явилась Стонога:
    - Вибачте, що спізнилась, але на те є причина. Я готувалась... Дуже не просто на сорок ніжок взути пуанти. І, витягнувши стопу, показала свій бездоганний підйом...
            `,
            {
              img: null,
              alt: '',
              size: '248x315',
              pictureDescription: '',
              heroes: [''],
              backgroundDescription: '',
            },
          ],
        },
        {
          title: 'Мудре рішення',
          content: [
            `
    Побачивши таку кількість охочих Павучок навіть на хвильку розгубився...На пеньку поміститься до 10 учнів, а що робити решті? І враз, йому в голову прийшло мудре розв'язання проблеми:
    - Доброго ранку шановні! Радий вас вітати у "Лісовій студії хореографії''. Сьогодні я поділю вас на групи по віку. З малечею я займатимусь до 12 - ої години дня, а дорослих запрошую на 13 - 00.
    Для занять, будь ласка, придбайте танцювальні черевички на шкіряній підошві. Характерною особливістю танцю є ритмічна ударна робота ніг. Як правило чечітка виконується у спеціальному взутті, підбитому металевими пластинами, як у мене. Та на дубовому пеньочку буде чути, ритм танцю і без пластин.
    - А мені до якої групи приєднатися? - запитала Стонога.
    - Звичайно до дорослих. Ви, пані Стонога, вже маєте початкову підготовку.
    - Можете звертатись до мене, на ім'я Сколопендра. Так, я дійсно, з дитинства займалась в балетній школі для обдарованих багатоніжок. І дуже люблю танець, тому з радістю буду вивчати елементи танцю чечітки.
    Павучку складно було уявити, як навчити танцювати відразу сорок ніжок. Але надії він не втрачав.
    - Прошу до студії наших найменших учасників! Провівши рукою він вказав на пеньок.
    Мишенята почали видиратися по корі. Павучок зупинив їх і показав, що для них є східці.
    - Будь ласка, по черзі, пропускаючи дівчаток вперед, підіймаємось на пеньок. Дівчатка на радощах поважно підіймалися на танцювальний майданчик. Та задерши носа, мало не попадали зі східців. Хлопчики за ними. Слідом піднялися білченята. Почалась репетиція...
    Батьки спостерігали, як малеча старатливо виконувала танцювальні рухи. А матуся Мишка, розчулена цим милим видовищем, не приховувала сліз.
    Дійсно мишенята були надзвичайно зворушливі та дуже талановиті.
    А Білочка Рижулька не зводила погляду зі своїх дитинчат. Як граційно вони рухалися! А які милі пухнасті хвостики у її малечі!
    "Лісова студія хореографії'' запрацювала.
            `,
            {
              img: null,
              alt: '',
              size: '248x315',
              pictureDescription: '',
              heroes: [''],
              backgroundDescription: '',
            },
          ],
        },
        {
          title: 'Дитячий майданчик',
          content: [
            `
    Наступного ранку Павучок вийшов підшукати місце для свого гамачка. Сонце за день гарно прогрівало землю. Морозів вночі не було. І він вирішив, що варто залишити шпаринку в пеньку і переселитися на свіже повітря. Та вже й пора починати полювання на кусючих мух. Плести павутину і заманювати їх у свої сіті. Павучок знав, що підтримувати баланс в природі це — його обов'язок. Інакше мухи закусають людей і тварин.
    Біля пеньочка він побачив мишенят, які перекочували соснову шишку. Привітавшись запитав, що збираються робити з шишкою?
    - Нічого, просто граємось, — відповіли хлопчики. А дівчатка, побачивши вчителя хореографії, мило присіли в реверансі.
    Павучок подумав, що було б добре для малюків спорудити в лісі дитячий майданчик. Там діти будуть розважатись. І вирішив порадитися з мешканцями лісу. Всі були в захваті від такої ідеї, особливо малюки. Вибрати місце доручили Сороці — білобоці та білочці Рижульці. Враховуючи, що діти — народ галасливий і теплолюбний, знайшли для них простору, гарно освітлену сонечком поляну. Проєктування розважальних атракціонів доручили Павучку і Лосю. Матусі — Мишка і Рижулька побажали, щоб розважальні об'єкти були максимально безпечними для діток. Тож Павучку і Лосю було над чим подумати:
    - Пропоную зробити батут, — мовив Павучок.- Я сплету густий гамак. Натягну його між дерев.
    А для безпеки під гамаком покладемо ялинових гілочок у декілька шарів. Це на той випадок, якщо хтось дрібний проскочить між нитками гамачка.
    - Доладно придумав, — похвалив Лось. І запропонував зробити гойдалки:
    - Одна зовсім безпечна. На колодку кладемо дошку і малеча гойдається.
    - Це добре, та де нам взяти дошку?
    - А у мене є на приміті одна.
    Це на нашій годівниці де сіно кладуть. Вона ледве тримається та заважає мені, а на гойдалку буде якраз.
    А другу гойдалку зробимо на канатах сплетених з ліан хмелю.
    - Який ви винахідливий! - в захваті промовив Павучок.
    - Але буде малувато розваг, весною малят багато, а до літа стане ще більше.- хвилювався Лось.
    - Може лісові мешканці запропонують ідеї? - мовив Павучок.
    На нараді зібралися всі жителі лісу. Бабак Тимко запропонував вчити малят художньому свисту.
    Горобчик — стрибати відразу на двох ніжках, а Заєць — навчити барабанити на барабані, який дістався йому від дідуся. А той невідомо де взяв барабана, але передав його у спадщину внуку.
    Дідусь пишався, що його внучок має довгі вуха та ідеальний слух.
    Коли все з'ясували прийшла лисичка. Звірята трішки занервували...Та вона дістала із — за спини м'яч! Справжнісінький гумовий! Малеча від радості заплескала в долоні. А Сорока своєю чергою поцікавилася звідки Лисичка взяла м'яч.
    - Не хвилюйтеся, м'яч мені подарував хлопчик з сусіднього села. В мене склалися з ним дружні відносини і я розповіла новину про дитячий майданчик для звірят. Він сам люб'язно запропонував відеречка і совочки для пісочниці.
    - От, добре, що ви нагадали про пісочницю, попрошу крота, щоб білого пісочку нам накопав.- підтримав ідею Павучок.
    Робота закипіла, кожен старався бути корисним. І за три дні Дитячий майданчик відкрили!
    І неначе до цього свята навколо поляни розквітла конвалія. Її неймовірний аромат наповнював повітря. А мишенята гордо повідомили:
    - Конвалія занесена до Червоної книги України, а ще вона дуже отруйна. Квіти, листочки, стебло і навіть ягідки брати не можна.
    Нам матуся Мишка розповідала, наперебій інформували мишенята.
    - Все правильно, конвалією краще милуватися в лісі й не зривати.
    Молодці, — похвалив Лось.
            `,
            {
              img: null,
              alt: '',
              size: '248x315',
              pictureDescription: '',
              heroes: [''],
              backgroundDescription: '',
            },
          ],
        },
        {
          title: 'Реставрація',
          content: [
            `
    Життя в лісі наповнювалось новими подіями. Дитячий майданчик щоденно приймав маленьких гостей. Вони почали приятелювати один з одним, потоваришували. І ось одного разу на майданчик прилетіло маленьке Сонечко. Воно ледве долетіло і маже впало на гамачок. Це привернуло увагу Павучка:
    - Сонечко, що сталося? І чому твої крильця обпалені?
    Сонечко, зі сльозами на очах, розповіло, що дрімало в кучі хмизу, а людина не помітила і підпалила гілля. І воно мало не згоріло. Коли розправило крилечка летіти, вогонь попалив ніжні під крильця, що знаходяться під твердими крилами.
    Воно повернулося і всі побачили напівзгорілі ніжні крилечка.
    Сонечко гірко заплакало:
    - Я не зможу літати й сад без мене загине.
    - А чому сад? - поцікавилися мишенята.
    - Це тому, що я рятую рослини від тлі. Люди мене люблять і ніколи мені не нашкодили б. Нині я виню себе, що залізло у той хмиз.
    І знову в оченятах заблищали сльози.
    -Так, — мовив Павучок, — здається, я знаю, як зарадити твоєму горю.
    Сонечко з надією подивилося на Павучка:
    - Але як?
    Звірі теж чекали, що запропонує Павучок.
    - Це, звичайно, буде дуууже ювелірна робота, але я запевняю тебе, що будеш літати! Я зроблю реставрацію* твоїх крилець.
    Тонка павутина має підсохнути й тоді ми спробуємо літати. Згода?
    Звірі з радістю заплескали лапками, а Сонечко, зрадівши, запитало:
    - А це не боляче? Та я потерплю, тому, що дуже хочу літати.
    Всі з цікавістю спостерігали, як Павучок вміло нарощував крильця. Закінчивши роботу, він задоволено потер лапками.
    - А зараз, Сонечко, прошу на сонечко, тобі потрібно дві години, щоб промінчики висушили твої нові крильця. Сонечко слухняно підставило спинку сонячним променям. Від тепла воно задрімало. Йому снилося, як воно підіймається високо в небо і всі йому посміхаються: сонечко, хмарки й навіть вітерець.
    - Прокидайся, соня! Чуєш? Треба спробувати злетіти. Світлячок намагався розбудити Сонечко.
    Павучок милувався своєю роботою. Нарощені крила неможливо було відрізнити від справжніх. Сонечко відкрило очі:
    - Час збіг так швидко й уявляєте, друзі, я літало... Правда, уві сні, — додало воно. Тінь невпевненості промайнула в його очах. Він дуже хвилювався, а чи злетить?
    - У тебе все вийде, ти тільки маєш повірити в себе, — заспокоїв Павучок.
    Лісові мешканці затамували подих...Безліч очей слідкувало за випробовуванням нових крилець. Сонечко високо підняло свої тверді крила і швидко затріпотіло маленькими мереживними крильцями...
    Воно піднялося в повітря та пролетіло декілька разів над дитячим майданчиком й задоволено вигукнуло:
    -Я лечу! Друзі, я знову літаю!
    Всі радісно вітали його, махаючи лапками й захоплено дивилися, як Сонечко, підлетівши до Павучка, зробило реверанс. Воно сяяло від щастя:
    - Дякую Вам, дорогий друже Павучок, ви врятували мене!
    - Радий був допомогти, ми ж друзі.
    І три пари його оченят заблищали.
    -Як добре, що є друзі! - думало Сонечко, здіймаючись високо в небо.

    *Реставра́ція — сукупність рятувальних, відновлювальних і консервативних засобів.
            `,
            {
              img: null,
              alt: '',
              size: '248x315',
              pictureDescription: '',
              heroes: [''],
              backgroundDescription: '',
            },
          ],
        },
        {
          title: 'Бджола',
          content: [
            `
    Сонечко щодня милувало природу своїми теплими променями. Скрізь розквітали квіти. Бджілки збирали нектар і запилювали їх. Мама Мишка вела свою малечу на дитячий майданчик. Їх вже з нетерпінням чекали білченята. Побачивши, галасливо поскакали на зустріч. На майданчику вони грали у квача* і веселилися.
    Одне мишеня, набігавшись, присіло на травичку. Поряд воно побачило квітку конюшини, вчора вона ще не розквітла, а сьогодні милувала своїм бузковим кольором. А на квітці — муха в смугастому костюмчику. Мишеняті здалося, що вона нюхає квітку, зануривши хоботок в серединку.
    - Приємно пахне? - запитало воно і носиком торкнулося квітки, вдихаючи пахощі. Заклопотана бджілка не чекала мишеняти й з переляку вчепилася йому в ніс. Воно від болю запищало на весь майданчик.
    Матуся Мишка кинулася до малого. Воно продовжувало репетувати від болю.
    - Що сталося? - запитала стурбована мама. Сльози горохом котилися з очей. Зіниці показували на кінчик носа, де застрягло жало бджоли. Мишка швиденько його висмикнула. А носик мишеняти почав набрякати.
    Білочка Рижулька порадила
    пити більше води. Місце укусу краще взагалі не чіпати, тим паче не розчісувати. Сорока — білобока миттю вискубнула в траві листочок й подала Мишці:
    - Це — лист подорожника. Він допоможе зняти набряк і загоїть рану. Але його треба гарненько розім'яти й зафіксувати на місці укусу. Мама Мишка приклала подорожник і пригорнула до себе мишеня:
    - Ось ти й познайомилося з бджілкою. Зазвичай бджоли не нападають першими.
    - Я побачила, що бджілка нюхає квіточку і хотіла відчути аромат, а вона вкусила, не чемна.
    - Бджоли у квітах збирають нектар, ти, напевно, її злякала, от і маємо неприємність.
    - Дуууже болюча ця неприємність, — промовило мишеня і, схлипуючи, пригорнулося до матусі.
    Павучок запропонував павутиною зафіксувати подорожник на носику.
    Їжачок десь знайшов маленького грибочка й простягнув мишеняті:
    - Пригощайся, малеча! Я знаю — тобі смакують грибочки.
    А білченя знайшло червонобоку суничку і подало мишеняті.
    Всі щиро співчували й надовго запам'ятали, що мухи в смугастих костюмчиках дуже боляче кусають і краще їх не чіпати.

    *Квач — поширена дитяча рухлива гра, в якій потрібно влучити м'ячем у втікача або, наздогнавши його, торкнутися рукою.
            `,
            {
              img: null,
              alt: '',
              size: '248x315',
              pictureDescription: '',
              heroes: [''],
              backgroundDescription: '',
            },
          ],
        },
        {
          title: 'Солоденька',
          content: [
            `
    Наступного дня на дитячому майданчику друзі цікавилися самопочуттям мишеняти. Йому приємна була увага. Ніс вже не болів, але набряк ще не зійшов.
    Мишеня навіть трішки хизувалося своїм найбільшим носом:
    - Він більший, як у Матусі, — мовило воно.
    - Не переймайся, це не надовго, — заспокоїла Мишка.- Якщо ти знову не підставиш його бджілці.
    - Ні, ні, матусю, я вже не буду їй заважати збирати нектар.- запевнило воно.
    - От і добре, грайтеся на галявині й далеко не відходьте. - застерегла Мишка.
    Мишенята з білченятами гралися м'ячем, бігали стрибали, а стомившись полягали на пісочку.
    Мишеня відчуло дивний дискомфорт. Рвучко повернувшись воно побачило очі, які незворушно дивилися на нього і повільно наближалися...
    Мишеняті стало моторошно, воно не могло навіть запищати від страху. Коли жовті очі були майже поряд їжак миттєво підскочив і кинувся на змія. Змій скрутився в клубок, потім різко вигнувся дугою й ухилившись від зубів їжака сховався в густій траві. Мишка метнулася до свого дитинчати, підхопила і лапками притисла до грудей.
    - Моя крихітко, ти дуже злякалося?
    - Так, — відповіло мишеня. Мамо, що то було?
    - То вуж хотів напасти на тебе, а Їжак відігнав і захистив.
    - Матусю, а чому він хотів напасти, я ж нічого поганого йому не зробило? - допитувалося мишеня.
    - Нам, мишкам, треба бути обачними, вужі та змії харчуються тваринною їжею. Змії ще й отруйні, а вужі ні. Характерною ознакою вужа є жовті "вушка". Вони можуть бути білуваті, помаранчеві, навіть блідо-червоні.
    Мишенята слухали, як заворожені, малеча ще не знала, яка небезпека може очікувати їх.
    - А чому вони на мене нападають? То бджола, то вуж.
    Напевно, що у мене найбільший ніс? - запитало мишеня.
    - А, я зрозуміло. Вчора, матусю, ти пригортала мене і казала: "моя солоденька'', вуж почув, своїми жовтими вушками, і вирішив спробувати на смак.
    - Напевно, але хоробрий пан Їжак відвів біду і за це ми повинні подякувати йому. Мишеня повернувшись до Їжака й мовило:
    - Дякую Вам, дорогий пане Їжачок, що врятували мене. І...Якби не голки, я б Вас міцно обійняло.
    - Дякую, дякую, — закричали гуртом мишенята. А мама Мишка подякувавши зі сльозами на очах, запросила Їжачка до себе на гостину.
            `,
            {
              img: null,
              alt: '',
              size: '248x315',
              pictureDescription: '',
              heroes: [''],
              backgroundDescription: '',
            },
          ],
        },
        {
          title: 'Барабан',
          content: [
            `
    Наступного дня Заєць приніс на дитячий майданчик свій барабан.
    Звірята оточили його з усіх сторін. Вони з цікавістю розглядали круглий предмет, обтягнутий шкірою. В лапках Зайчик тримав дві дерев'яні палички з потовщеннями на кінцях. Він легенько постукав по барабану. Ритмічні удари народжували мелодію. Білченя не приховувало свого захоплення:
    - А можна мені спробувати? - попросило воно.
    - Так, авжеж. - І Зайчик передав палички білченяті.
    Воно з усієї сили затарабанило по барабану! Звірята затулили вуха!
    - Щось у мене барабан не хоче грати.... — розчаровано мовило воно.
    - Не засмучуйся, з часом у тебе все вийде. Гра на барабані – це не просто
    хаотичні удари паличками по натягнутій мембрані. Це — мистецтво і наполеглива праця.- заспокоїв його Зайчик.
    - І я хочу спробувати, і я, і я! - наперебій просила рудохвоста малеча. Вони по черзі намагалися найгучніше зіграти на барабані. Але, зрозумівши, що крім тарараму, від їхньої гри нічого путнього не виходить — віддали палички Зайчику.
    Зайчик розповів, що в оркестрі саме барабан створює настрій.
    - А що таке оркестр? - запитав Світлячок, який сидів поряд з Павучком на гамачку.
    - Це — колектив музикантів, де кожен на своєму музичному інструменті виконують музичний твір.
    - А звідки, Зайчику, ви все знаєте? - цікавився Світлячок.
    - Дідусь грав в оркестрі на барабанах, він був знаним музикантом і мені розповідав. Я — лише аматор.
    Звірята підходили до Зайчика і кожен хотів хоча б доторкнутися до барабана. Мишенята лапками
    стукали по мембрані тому, що палички були для них завеликі.
    Цілий день на майданчику було гамірно, барабан не замовкав.
    І лише з настанням сутінків настала тиша. Матусі вели додому своїх дитинчат. Малеча ділилася враженнями, адже вони грали на справжнісінькому барабані. Зайчик, стомлений, але щасливий, дрімав під вітами густої ялини. День добігав кінця.
            `,
            {
              img: null,
              alt: '',
              size: '248x315',
              pictureDescription: '',
              heroes: [''],
              backgroundDescription: '',
            },
          ],
        },
        {
          title: 'Мурашник',
          content: [
            `
    Наступного ранку Павучок запросив поважного Крота додати свіжого пісочку в дитячу пісочницю. Дітлахи, граючись, порозносили його. Кріт дуже старався до приходу малюків, і гірка свіжого пісочку виднілась здалеку. Мишенята з писком пірнали в нього. Кріт, вирішивши подивитись чи достатньо, виліз з нори.
    - Дякую тобі, друже, чудова робота! — мовив Павучок.
    - Будь ласка, звертайтесь, коли потрібно.- Відповів Кріт. Його оксамитово — чорна шубка переливалась бархатом на сонці.
    А маленькі очі зіщулились від денного світла. Він майже нічого не бачив, звикши жити під землею, куди не проникало сонячне проміння.
    - Тут десь є пеньочок, трішки відпочину і знову ритиму тунелі.
    Вмостившись на пеньок, він задоволено закряхтів. Та враз відчув, що по ньому почало щось бігати. Від дискомфорту він швидко підвівся.
    - Друже, ти всівся на мурашник і
    мурахи почнуть тебе кусати. - повідомив Павучок.
    - Мою шубку вони не прокусять, але дуже лоскотно.- посміхаючись, мовив Кріт. - Минулого разу я тут відпочивав.
    - Та віднедавна ми будуємо тут собі будинок. А ви, шановний, всілися на його дах і мало не розчавили нас! - почув слабенький, але гнівний голос Кріт.
    - Перепрошую, та я не помітив вас.- він, прищулившись, ледве роздивився маленьких комах. Мурахи активно рухаючись, відновлювали пошкоджений мурашник.
    Вони носили вантажі більші за вагу свого тіла.
    - Дуже розумна і працьовита комаха, — повідомив Павучок.- Їх тут до мільйона. Втікай звідти, друже, а то залоскочуть.
    - Так, я чув від своєї бабусі, що Мурахи – єдині істоти, окрім людей, які займаються випасом худоби. Вони розводять та охороняють попелиць, а ті натомість виділяють солодкий нектар, який називають медяною росою. Її дуже люблять мурахи, тому охороняють попелиць.
    - А ще мурахи, які мешкають в одному гнізді, мають однаковий запах. Таким чином, вони пізнають один одного і не пускають у своє житло інших комах. - додав Павучок.
    - Дякую Вам, дуже цікаво! - пропищало мишеня, яке уважно слухало розповідь друзів.
    - Мурахи – це найрозумніші комахи. Мозок складається з 250 тис. клітин. Я читала у лісовій Вікіпедії, — додала Сорока — білобока, яка спостерігала з гілки за майданчиком.
    Він наповнювався галасом дітлахів, що не приховували своєї радості, побачивши свіжий пісочок, нові совочки та відерця, які принесла пані Лисичка. Вона дотрималася своєї обіцянки.
            `,
            {
              img: null,
              alt: '',
              size: '248x315',
              pictureDescription: '',
              heroes: [''],
              backgroundDescription: '',
            },
          ],
        },
        {
          title: 'Свято Мами (приготування)',
          content: [
            `
    Наближалося свято Мами й лісові мешканці готували святковий концерт. Порадившись, вирішили тимчасово накрити пісочницю дошками та зробити сцену, де буде проходити концерт. Павучок готував кілька номерів степу зі своїми учнями з "Лісової студії хореографії''. А Стонога до того готувала ще й балетне соло з балету "Русалонька''. Заєць обіцяв здивувати грою на барабанах. Горобець запросив свого товариша Соловейка і вони готували пісню в дуеті. Пообіцявши розчулити всіх матусь. Один Лось сумно дивився на приготування.
    Сорока, гортаючи сценарій, звернула увагу на безрадісні очі цієї великої, могутньої тварини та запитала:
    - Шановний, щось сталося?
    - Ні, ні... Все добре. Просто у мене нема таких талантів і я не маю номера для святкового концерту.
    - Як не маєте таланту?! - Здивувалась пані Сорока й окуляри з'їхали на кінчик її дзьоба.
    - Але Ваша доброта, то — найбільший талант, — мовила вона і додала:
    - Ви зможете зробити екскурсію по лісу. І на вашій широкій спині поміститься маже все лісове товариство.
    - Ну, це вже ви перебільшуєте, шановна пані Сорока, але мені приємні ваші компліменти. Він мило посміхнувся і додав:
    - Дякую Вам, за ідею, обдумаю все й обов'язково додам до Святкової програми.
    Настрій у нього поліпшився,
    очі заблищали, а в голові закрутився рій думок.
    Тим часом з нори виліз Кріт:
    - Гарного дня, друзі. О, а де поділась пісочниця і пісок? - Він, примруживши очі, намагався розгледіти, що тут діється.
    - У нас ідуть приготування до Свята Мами й ви можете взяти участь, — мовив Павучок.
    - Ні, цей захід не для мене, я і так ледве бачу. Сонце засліплює. Знадобиться пісок для пісочниці, сповіщайте, — відповів Кріт і швиденько сховався під землю. Та незабаром на дитячому майданчику з'явилась Лисичка.
    Звірята дружньо зустріли її після того, як вона приносила на Різдво Ангеликів, а на майданчик — м'ячика і відеречка для малюків. Та вона прийшла не одна...
    Тримаючись за матусю, поряд крутилося четверо малесеньких руденьких лисенят. Вони з цікавістю малечі розглядали дитячий майданчик.
    - Я теж нині Матуся, — повідомила Лисичка, показуючи на руденьких пухнастиків.
    - Ми щиро вітаємо вас! - Звернувся до Лисички Павучок.
    Матуся Мишка, на всяк випадок, попередила, що на майданчику панує приязне ставлення один до одного. А мама Лисичка повідомила, що про поведінку на майданчику діти знають. - Але для
    впевненості я наглядатиму за ними. Їм дуже хотілося погратися з іншими малятами. І до Свята Мами у нас також буде сюрприз.
    - Ой, боюсь я цих сюрпризів, — мовила мама Зайчиха.
    - Нічого страшного. Моя малеча хоч і талановита, але ще дуже маленька. І ми вирішили розносити солодощі на Святі.
    Вся малеча, що була на майданчику, радісно заплескала в лапки. Ну, хто відмовиться від смакоти...
            `,
            {
              img: null,
              alt: '',
              size: '248x315',
              pictureDescription: '',
              heroes: [''],
              backgroundDescription: '',
            },
          ],
        },
        {
          title: 'Свято Мами (виступ на сцені)',
          content: [
            `
    Вся малеча хвилювалася перед виступом. Матусі непокоїлися ще більше своїх дитинчат. Світлячок в чергове репетирував соло й хвацько вистукував черевичками на сцені. Стонога неподалік одягала пуанти й зав'язувала стрічки на ніжках. Мишенята з заздрістю дивились на маленькі атласні балеточки.
    Сорока, посадивши матусь перед сценою, попередила, що за десять хвилин починаємо!
    І ось першими на сцену виходить дует Горобця і Соловейка. Партії, розписані Соловейком, виконуються бездоганно. Хвиля оплесків і артисти не приховують свого задоволення від виступу. Наступні — найменша за віком група степу під керівництвом викладача Павучка. Малеча так старалась, що матусі від милоти заплакали. Продовжив програму Заєць на барабанах. Він був неперевершеним. А виступ Стоноги підняв глядачів і супроводжувався тривалими оплесками. Це було соло з балету "Русалонька'' за мотивами казки
    Ганса Крі́стіана А́ндерсена — данського письменника, казкаря, автора відомих у всьому світі казок «Непохитний олов'яний солдатик», «Гидке каченя», «Снігова королева», «Дюймовочка», «Дівчинка з сірниками», «Принцеса на горошині» та інших.
    Всі дивувалися, як Стонога легко, граційними рухами справлялася зі своїми сорока ніжками.
    - Воістину високе мистецтво, — мовив Павучок. Публіка ще довго не відпускала Стоногу.
    Вона двічі виконувала свій неймовірний танець.
    По закінченні концерту щасливі матусі з дітлахами отримали солодощі. Їх роздавали лисенята, дістаючи з маленьких кошиків.
    Це були медові стільники* на паличках.
    Бджолина сім'я передала Лисичкою гостинці на Свято Мами. Звірята з задоволенням смакували медом. Мама Мишка обтирала носика мишеняти, яке необережно вимастилось липким нектаром.
    - Сьогодні я дійсно солоденьке! — задоволено  промовило воно.
    - Найсолодше, — обійнявши, прошепотіла Мишка.
    А поважний Лось, зібравши всіх охочих і сміливих на спині, почав екскурсію по лісу. Білченята і зайчата дуже добре знали свій ліс, але їм вельми хотілося покататися на спині пана Лося. Там було тепло, м'яко і подорож заколихувала...Одне білченя задрімало і скотилося зі спини прямо в зарослі конвалії.
    Матуся помітила і попросила пана Лося зупинитися. Маленьке здивовано роздивлялося квіти.
    Потім зрозуміло, що опинилося на землі, але поряд вже була білочка Рижулька. Вона миттєво підхопила згубу і вискочила Лосю на спину. Екскурсія продовжилася. Лось вивіз їх на край лісу і показав помешкання, де живе людина.
    Розповів, що люди зазвичай хороші. Взимку підгодовують тварин й птахів, та бувають і такі, що завдають шкоди природі.
    То — погані люди, вони викидають сміття в лісі, розпалюють багаття, залишаючи жар, який часто спричиняє пожежі. Рижуля пригадала, як втікала від пожежі.
    І не відомо, як би все закінчилось, якби дощ не загасив полум'я.
      День проводжав сонечко за обрій. Стомлена, насиченими подіями малеча зі своїми Матусями, поверталася додому.
    По дорозі на майданчику вони побачили Стоногу, яка, посміхаючись, знімала останню пару пуантів.
    Всі були задоволені,
    свято вдалося.

    Бджоли́ні стільники́*, також щільники́ — листи, утворені чашечками з воску.
            `,
            {
              img: null,
              alt: '',
              size: '248x315',
              pictureDescription: '',
              heroes: [''],
              backgroundDescription: '',
            },
          ],
        },
      ],
    },
  }),

  computed: {
    menuList() {
      return this.book.chapters.map((item) => item.title);
    },
  },

  methods: {
    scrollTo(eRef) {
      const elem = this.$refs[eRef];
      if (elem) {
        const topOfElement = elem[0].offsetTop;
        window.scrollTo({ top: topOfElement, behavior: 'smooth' });
      }
    },

    getListHeroes(list) {
      if (Array.isArray(list) && list.length) {
        return list.join(', ');
      }
      return '-';
    },
  },
};
</script>
